app/controllers/pages_controller.rb

    def index
        @pages = Page.all
---
SELECT  "pages".* FROM "pages" ORDER BY "pages"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def create
        @page = Page.new(page_params)
        @page.save
---
INSERT INTO "pages" ("title", "body", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Title"], ["body", "this is a body"], ["slug", "title"], ["created_at", "2018-02-08 17:54:11.696368"], ["updated_at", "2018-02-08 17:54:11.696368"]]

    def edit
        @page = Page.find(params[:id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def update
        @page = Page.find(params[:id])
        @page.update(page_params)
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "pages" SET "body" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["body", "Zorbot Moon Moon Explorer Urrrrrrrrdfgfdh"], ["updated_at", "2018-02-08 19:05:34.925792"], ["id", 3]]